<?php

session_start();

if (isset($_SESSION["user_id"])) {
    
    $mysqli = require __DIR__ . "/database.php";
    
    $sql = "SELECT * FROM user
            WHERE id = {$_SESSION["user_id"]}";
            
    $result = $mysqli->query($sql);
    
    $user = $result->fetch_assoc();
}
?>








<!DOCTYPE html>
<html>

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>مكتبة الإسكندرية</title>
    <link rel="stylesheet" href="styles.css">
</head>

<body onload="showSlides()">
    <header>
    <?php if (isset($user)): ?>
        
        <p class="user"> <img src="./photos/logo.webp" alt="Library of Alexandria"  height="30" width="30" > </img> <?= htmlspecialchars($user["name"]) ?></p>
        
        <p><a href="logout.php" class="button1">Log out</a></p>
    
        <?php else: ?>

        <div>
            <a href="login.php" class="button1" >Log in</a> 
            <a href="signup.html" class="button2">sign up</a>
        </div>
         
        <?php endif; ?>




        <h1>مرحبا بكم في مكتبة الإسكندرية</h1>
        <nav>
            <ul>
                <li><a href="index.html">Home</a></li>
                <li><a href="resources.html">Additional Resources</a></li>
            </ul>
        </nav>
        


        <div class="language-selector">
        <label for="Language">لغة:</label>

        <select name="Language" id="Language" >
            <option value="Arabic">عربي</option>
            <option value="English">إنجليزي</option>
        </select>
        </div>  


    </header>



    <script>
        document.getElementById('Language').addEventListener('change', function() {
            var selectedLanguage = this.value;
            if (selectedLanguage === 'English') {
                window.location.href = 'index.php'; 
            }
        });
    </script>




    <main>
        <section>
            <h2>عن المكتبة</h2>
            <ul>
            
            <div>    
            <li><strong>مقدمة</strong></li>
            <p>
                تعد مكتبة الإسكندرية الجديدة، أو الهيئة العامة لمكتبة الإسكندرية، إعادة إحياء لمكتبة الإسكندرية القديمة، وهي أكبر مكتبة في عصرها، في مشروع ضخم نفذته مصر بالشراكة مع الأمم المتحدة، حيث وتم بناء المكتبة مرة أخرى في موقع قريب من المكتبة القديمة بمنطقة الشاطبي بالمدينة. تم افتتاح المكتبة الحديثة في 16 أكتوبر 2002 بحضور عالمي. المكتبة تابعة لرئيس الجمهورية.
            </p>             
            <br>
            <hr/>
            </div>
            
            <br>
             
            <div>
            <li><strong> تاريخ </strong></li>
            <p>
                مكتبة الإسكندرية، مؤسسة بحثية في الإسكندرية، مصر، استلهمت أفكارها من مكتبة الإسكندرية في العصر الكلاسيكي.

                 تم طرح فكرة إحياء المكتبة القديمة لأول مرة في عام 1972 من قبل مصطفى العبادي، الأستاذ بجامعة الإسكندرية. وقررت الحكومة المصرية رعاية المشروع، وحظي بدعاية ودعم دوليين من خلال منظمة اليونسكو. تم اختيار موقع مجاور لجامعة الإسكندرية وبالقرب من موقع المكتبة القديمة.
                
                 تم الانتهاء من بناء المبنى الذي تبلغ تكلفته 200 مليون دولار في عام 2001، وقد نال تصميم المكتبة إشادة عالمية. في الأساس، المكتبة عبارة عن أسطوانة ضخمة تخرج من الأرض بزاوية ضحلة على بعد حوالي 130 قدمًا (40 مترًا) فقط من البحر الأبيض المتوسط. ويشير السقف على شكل قرص إلى شروق الشمس فوق البحر الأبيض المتوسط، ويشبه نمط السقف المصنوع من ألواح الألمنيوم والزجاج رقاقة إلكترونية. يتكون أحد الجدران الخارجية للهيكل من حوالي 6400 لوح من الجرانيت تحمل أحرفًا من جميع الأبجديات المعروفة.
            </p>
            <img src="./photos/Alexandria-Library-Egypt-Tours-Portal.jpg" alt="Library of Alexandria"  height="400" width="700" class="photo1"> </img>
            <br>
            <hr/>
            </div>
             
            <br>

            <div>    
            <li><strong> كتب </strong></li>
            <p>
                تحتوي المكتبة على مجموعة كبيرة من الكتب تقدر بنحو 2 مليون كتاب (بحاجة لمصدر) في بداية عام 2013 مختارة باللغات العربية والإنجليزية والفرنسية، بالإضافة إلى مجموعة مختارة من الكتب باللغات الأوروبية الأخرى مثل الألمانية والإيطالية والإسبانية وغيرها اللغات النادرة مثل الكريولية والهايتية والزولو. تتضمن المجموعة الحالية مصادر من الجهات المانحة من جميع أنحاء العالم حول مواضيع مختلفة.   
            </p>             
            <br>
            <li><strong> مركز أرشيف الإنترنت </strong></li>
            <br>
            <ol>
            <li>لقطة من شبكة المعلومات العالمية من عام 1996 حتى الآن (لجميع المواقع كل شهرين).</li>
            <li>أكثر من 10 مليار صفحة - نصوص أكثر مما يوجد في مكتبة الكونجرس.</li>
            <li>1000 فيلم مؤرشف.</li>
            <li>2000 ساعة بث تلفزيوني مصري وأمريكي.</li>
            <li>100 تيرابايت من المعلومات مخزنة على 200 جهاز كمبيوتر.</li>
            <li>إمكانية مسح الكتب المحلية.</li>   
            </ol>
            <br>
            <img src="./photos/450px-Alexandrina_Library_in_Alexandria,_Egypt._03.jpg" alt="Library of Alexandria"  height="300" width="500" > </img>
            <img src="./photos/BA_planetarium_and_plaza.jpg" alt="Library of Alexandria"  height="300" width="350" > </img>
            <img src="./photos/BA_outer_view.jpg" alt="Library of Alexandria"  height="300" width="500" > </img>
            <br>
            <hr/>
            </div>

            <br>

            <div>    
            <li><strong> المتاحف </strong></li>
            <p>
                تضم مكتبة الإسكندرية أربعة متاحف:   
            <ol>   
            <li> المتحف الأثري </li>
            <li>متحف المخطوطات والكتب النادرة </li>
            <li>متحف السادات </li>
            <li>متحف تاريخ العلوم </li>
            </ol>           
            <br>
            <li><strong>بعض الصور داخل المتاحف</strong></li>
            <br>
            
            <section>
                <div class="slideshow">
                    <img src="./Photos/202208251411116229_.jpg" alt="Museum"  height="300" width="400" class="photo1">
                </div>
                <div class="slideshow" style="display:none;">
                    <img src="./Photos/2022082515012354545_.jpeg" alt="Museum"  height="300" width="400" class="photo1">
                </div>
                <div class="slideshow" style="display:none;">
                    <img src="./Photos/2022082515075097050_.jpeg" alt="Museum"  height="300" width="400" class="photo1">
                </div>             
                <div class="slideshow" style="display:none;">
                    <img src="./Photos/2164792-مقتنيات-متحف-السادات.webp" alt="Museum"  height="300" width="400" class="photo1">
                </div>
            </section>

            <br>
            لمزيد من الصور انقر على هذا <a href="resources.html"> الرابط </a>
             
            </p>

            <hr/>
            </div>

            <br>

            <div>    
            <li><strong>سبع مكتبات متخصصة</strong></li>
            <p>
                مكتبة المواد السمعية والبصرية: تتضمن مكتبة الوسائط المتعددة أنواعًا مختلفة من الوسائط السمعية والبصرية. وتغطي المواد السمعية والبصرية مواضيع متنوعة: تربوية، دينية، ثقافية، سياسية، تسجيلية، سينمائية، بالإضافة إلى طرق التعليم الذاتي للغات المختلفة، وبرامج الحاسوب وغيرها من وسائل التعليم الذاتي في مختلف المجالات، بالإضافة إلى تسجيلات كافة المؤتمرات والحفلات الموسيقية والفنية والمعارض التي تقام بمكتبة الإسكندرية.
                 مكتبة المكفوفين (مكتبة طه حسين): تمثل مكتبة طه حسين مفهومًا جديدًا يفتح آفاقًا جديدة للمكفوفين وضعاف البصر، ويمكّنهم من الوصول إلى موارد مكتبة الإسكندرية بالإضافة إلى موارد الإنترنت.
                 تتمثل الأهداف الأساسية لهذه المكتبة في تعزيز التعاون الوطني والدولي وتشجيع البحث والتطوير في هذا المجال، وتمكين المكفوفين وضعاف البصر من الوصول إلى المعلومات، وبالتالي محاولة إدخالهم إلى عصر جديد من المعرفة وتكنولوجيا المعلومات. تهدف المكتبة إلى خلق جيل جديد من المكفوفين وضعاف البصر حتى يتمكنوا من مواجهة العصر الإلكتروني الجديد ويصبحوا قادرين على مواكبة تكنولوجيا المعلومات.
                 مكتبة الطفل: هي مكتبة مخصصة للأطفال من عمر 6-12 سنة. ويستمر في تشجيع الأطفال على القراءة والبحث، كما يهدف إلى إعداد الأطفال للاستخدام الرئيسي في المستقبل بكل خدماته وإمكانياته.
                 مكتبة الشباب: هي مكتبة متخصصة للشباب الذين تتراوح أعمارهم بين 12 إلى 16 سنة، وتحتاج إلى تأهيل وتدريب الشباب على القراءة حتى يصبح كل منهم ضروريا لاستخدام كافة الخدمات المتوفرة في المكتبة الرئيسية عندما بلوغ سن 16 عاماً.[1]
                 مكتبة المواد الميكروفيلمية: أتاحت قاعة تأكيد الميكروفيلم الفرصة للباحثين للتأكد من عدد من المخطوطات والوثائق المختلفة، بالإضافة إلى الصحف الصادرة منذ تاريخ نشرها، بالإضافة إلى مجموعة من الكتب الخاصة على شكل ميكروفيلم.
                 الكتب الدموية والمجموعات الخاصة: دورة الكتب الدراسية مجموعة الكتب المملوكة لمكتبة الإسكندرية والتي طبعت قبل عام 1920، بالإضافة إلى عدد من الكتب المتبرع بها ونسخ الكتب النادرة والطبعات المحدودة.
                 كما تضم قاعة عرض المخطوطات مجموعة من المخطوطات المملوكة لمكتبة الإسكندرية، منها العربية والتركية والفارسية.
                
                 مكتبة الرسائل الإلكترونية: أكثر من سبعة آلاف خريطة تغطي جميع أنحاء العالم وخاصة مصر والخدمات العربية والمطلة على البحر الأبيض المتوسط. يغطي الإصدار الثالث أنواعًا مختلفة من القراءة، مثل تخصيص المدن، وخرائط العالم، والخرائط الطبوغرافية، والخرائط الجغرافية، والخرائط الكنتورية، وخرائط الطرق وخطوط النقل، والخرائط الموضوعية، والخرائط الملاحية والجغرافية، وخرائط الأقمار الصناعية. وتضم المؤسسة أيضًا أكثر من 500 أطلس وعدد من الكرات الأرضية الإقليمية.
                 ومن أهم مقتنيات المكتبة العامة نسخة أصلية من الخريطة المجمعة التي رسمها المجمع العلمي العراقي عام 1951م، من خرائط كتاب “صورة الأرض” للشريف الإدريسي، والتي وكان الإدريسي قد عين للملك روجر الثاني ملك سيسيليا عام 1154 م. وكذلك نسخة أصلية من خريطة طبوغرافية مخطوطة للخليج العربي وبلاد الرافدين تعود إلى القرن السابع عشر.
                
                
                 تم تصميم الجزء الخارجي للمكتبة للسماح لأشعة الشمس الطبيعية بالدخول إلى الداخل، مع مراعاة تكاليف الإضاءة الاصطناعية
                 تقع مكتبة الاستماع في الطابق الرابع السفلي (B4) في قاعات المكتبة الرئيسية.
            </p>             
            <br>
            <hr/>
            </div>

            <br> 

            </ul>
        </section>

        <section>
            <h2>الموقع</h2>
            <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3454.0750291062736!2d31.211077775212747!3d30.034705274928463!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x145847502b58d44b%3A0xc7de9ca732369f3f!2zQmlibGlvdGhlY2EgQWxleGFuZHJpbmEg2YXZg9iq2KjYqSDYp9mE2KXYs9mD2YbYr9ix2YrYqQ!5e0!3m2!1sen!2sus!4v1710625196129!5m2!1sen!2sus" width="600" height="450" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
        </section>

        
    </main>

    <footer>




        <p>About Us:
           <br>
           Name : Hossam Ahmed Aldesouky Ahmed / ID : 2205097
           <br>
           &copy; copyright 2024  
        </p>
        
    </footer>
    
    <script src="script.js"></script>
</body>

</html>